package com.xzzz.Other.写着玩的小工具;

import java.util.Arrays;
import java.util.HashSet;
import java.util.Set;

public class 字符串去重 {

    private static String str = "乔木：   香泡、娜塔栎、香樟、桂花、栾树、红枫、樱花、鸡爪槭、海棠\n" +
            "灌木球： 亮金女贞球、金丝桃、栀子球、含笑球、地肤、南天竹\n" +
            "地被:    粉黛乱子草、小兔子狼尾草、血草、紫穗狼尾草、橘红苔草、花叶芒、金叶石菖蒲、斑叶芒、柳枝稷、玲珑芒、细叶画眉草、细茎针茅、常绿蒲苇、蓝羊茅、柠檬香茅、臺草、矮蒲苇等\n" +
            "常绿萱草、矾根、黄金菊、毛鹃、石蒜、红叶石楠、花叶蔓长春、杜鹃、石竹、月季、红花继木\n" +
            "\n" +
            "乔木：日本早樱\n" +
            "地被: 云锦杜鹃、黄金构骨、火焰南天竹、柳叶马鞭草、常绿萱草、欧石竹、金娃娃萱草\n" +
            "\n" +
            "乔木：榉树、乌桕、早樱、红梅\n" +
            "藤本 :紫藤\n" +
            "灌木球：木芙蓉、喷雪花球、香雪球、毛鹃球\n" +
            "地被   :狼尾草、吉祥草+二月兰、云锦杜鹃、郁金香、常绿萱草、紫娇花、木茼蒿\n" +
            "水生植物：黄花鸢尾、黄菖蒲、千屈菜、野茭白\n" +
            "\n" +
            "乔木： 金桂、刺桂、枇杷、枸橘、红梅、紫玉兰、腊梅、红枫、紫荆、花石榴、碧桃、芭蕉\n" +
            "藤本及竹类：凌霄、花孝顺竹、菲白竹\n" +
            "灌木球：八仙花球、喷雪花球、茶梅球、海桐球、结香、香雪球、山茶球\n" +
            "地被:  杜鹃、茉莉、五色梅、火棘、玉簪、景天、兰花三七、欧石竹、小叶栀子、薰衣草、地被菊、野薄荷、黄馨、荆芥、迷迭香、罗勒、柠檬香茅、百合、麦冬、藿香\n" +
            "\n" +
            "乔木：金桔、金桂、腊梅、红枫\n" +
            "藤本及竹类：菲白竹、花孝顺竹\t\n" +
            "灌木球：喷雪花球、香雪球、结香、八仙花球\n" +
            "地被:   金银花、板蓝根、决明子、连翘、芍药、桔梗、贝母、地锦草、紫云英、金鸡菊、黄花菜、铁皮石斛、白术、百里香、月季、荷兰菊、黄金菊、满天星、卢莉草、山桃草、水果篮、中国紫罗兰、香兰叶、艾草、银叶菊、大花葱、韭兰、紫松果菊、钓钟柳、白晶菊、福禄考\n" +
            "\n" +
            "室内观叶植物：散尾葵、袖珍椰子、幸福树、富贵竹、金脉爵床、八角金盘、春羽、蜘蛛抱蛋、棕竹、喜林芋、虎皮兰、肾蕨、波斯顿厥、芦荟、海桐、酒瓶兰、鹿角蕨、竹芋、绿萝、常春藤、沿阶草、玉龙草、虎耳草、铜钱草\n" +
            "室内观花植物：八仙花、吊兰、仙客来、君子兰、白鹤芋、冷水花\n" +
            "\n" +
            "乔木： 银杏、雪松、杜仲、悬铃木、石楠、玉兰、紫薇、木槿、石榴、碧桃、红枫\n" +
            "灌木球：八仙花球、喷雪花、胡颓子球、毛鹃球、茶梅球、红花继木球、火棘球、\n" +
            "地被:  红叶石楠、八角金盘、洒金珊瑚、红花继木、鸢尾、萱草、麦冬、葱兰、杜鹃、花叶蔓长春、紫金牛、兰花三七、矾根、石蒜\n" +
            "\n" +
            "乔木： 红枫、红梅\n" +
            "藤本及竹类：花孝顺竹、佛肚竹、黄金镶碧玉竹、菲白竹、凤凰竹、观音竹、箬竹、\n" +
            "灌木球：木芙蓉、八仙花球、喷雪花、南天竹、胡颓子、亮金女贞、毛鹃球\n" +
            "地被:   狼尾草、二月兰、黄馨、野蔷薇、萱草、晨光芒、矾根、玉簪、常春藤、石蒜、臺草、木贼、杜鹃\n" +
            "水生植物：德国鸢尾、黄菖蒲、美人蕉、再力花、玉蝉花、睡莲、野茭白、千屈菜、蒲草、水葱、黄花鸢尾\n" +
            "\n" +
            "乔木：  红梅、紫薇\n" +
            "灌木球：红叶石楠球、毛鹃球、茶梅球\n" +
            "地被:   红叶石楠、红花继木、毛鹃、石蒜、常绿萱草、花叶蔓长春、火焰南天竹、书带草、麦冬、欧石竹";

    private static String[] ignores = new String[]{
            "乔木:",
            "灌木球:",
            "地被:",
            "藤本:",
            "藤本及竹类:",
            "室内观叶植物:",
            "室内观花植物:",
            "水生植物:",
            "\t"
    };

    public static void main(String[] args) {
        str = str
                .replace("：", ":")
                .replace("\n", "、")
                .replace(" ", "");

        for (String ignore : ignores) {
            str = str.replace(ignore, "");
        }

        String[] result = str.split("、");

        Set<String> resultSet = new HashSet<>(Arrays.asList(result));

        int i = 1;
        for (String s : resultSet) {
            System.out.println(String.format("%s : %s", i++, s));
        }

    }

}
