package com.jasmine.Other.基础数学知识.基础名词;


public class 公约数和公倍数 {
    /**
     *
    一. 公约数(必须是自然数)
        @see 自然数
        @see 约数和倍数

        1. 定义:
            公因数，亦称“公约数”。给定若干个整数，如果有一个(些)数是它们共同的因数，那么这个(些)数就叫做它们的公因数。
            而全部公因数中最大的那个，称为这些整数的最大公因数。

        2. 例如:
                       约数1     约数2     约数3     约数4
            数1  10      1        2         5        10
            数2   8      1        2         4         8

            其中,约数 1、2 为 (10 和 8) 的公约数,其中 2 是 (10 和 8) 的最大公约数.


    二. 公倍数(必须是自然数)

        1.定义:
            公倍数(common multiple)是指在两个或两个以上的自然数中，如果它们有相同的倍数，这些倍数就是它们的公倍数。
            公倍数中最小的，就称为这些整数的最小公倍数（lowest common multiple）。

        2.例如:

                        倍数1   倍数2  倍数3  倍数4  倍数5  倍数6  倍数7  倍数8  倍数8  倍数8  倍数9  倍数10  倍数11
            数1   2 |     1       2     4      6      8     10    12     14     16    <18>   20     22     <24>
            数2   3 |     1       3     6      9      12    15   <18>    21    <24>

            其中
            18,24是2和3的倍数
            18是最小公倍数

     */
}
