:: ========================================================
:: 用于遍历某文件夹下的全部文件,并转移到指定目录中
::
:: author : xzzz
:: date : 2020-05-30
::
:: ========================================================

@echo off
color 2
echo ======================================================================
echo ===============                准备转移                ===============
echo ======================================================================

set  targetPath=F:\迅雷下载
echo %targetPath%
set count

:: /r : 当前目录和子目录
:: move "%%a" 需要加引号,否则文件名中包含空格时无法移动,会报错:命令语法不正确
for /r %%a in (*.mp4) do (
	echo 准备转移 : %%a
	move "%%a" %targetPath%
	echo ======================================================================
	set /a count+=1
)

echo 转移完成,文件数: %count%
echo by xzzz

@pause