package com.jasmine.Java高级.数据结构;

public class 概念 {
    /**
     *
     *



    一. 什么是数据结构
        数据: 所有能输入到计算机中并被计算机程序处理的符号的总称.
        数据结构: 互相关联的数据的集合

    二. 数据结构的类型

        数据的逻辑结构
        |
        ├── 线性结构
        |   |
        |   ├── 数组
        |   |
        |   ├── 链表
        |   |
        |   ├── 散列表
        |   |   @see com.jasmine.Java高级.数据结构.散列表哈希表结构.概念
        |   ├── 堆
        |   |
        |   ├── 栈
        |   |
        |   └── 队列
        |
        |
        |
        └── 非线性结构
            ├── 树形结构
            |
            |   @see com.jasmine.Java高级.数据结构.树型结构.概念
            └── 图形结构


        数据的存储结构 (计算机中只有这两者存储方式,所有的数据结构都基于此的逻辑结构)
        |
        ├── 顺序存储
        |   例如:
        |       数组: 在堆(stack)中建立的一串相连的地址
        |
        └── 链式存储
            例如:
                链表: 一连串不相连的内存
                @see com.jasmine.数据结构.线性结构.概念

     */
}
