package com.jasmine.Other.基础数学知识.基础名词;

public class 互质数 {
    /**

    一.定义
        互质数为数学中的一种概念，即两个或多个整数的公约数只有1的非零自然数。公约数只有1的两个非零自然数，叫做互质数。
        @see 公约数和公倍数

        互质数具有以下定理：
            （1）两个数的公约数只有1的两个非零自然数,叫做互质数；举例：2和3，公约数只有1，为互质数；
            （2）多个数的若干个最大公约数只有1的正整数，叫做互质数；
            （3）两个不同的质数，为互质数；
            （4）1和任何自然数互质。两个不同的质数互质。一个质数和一个合数，这两个数不是倍数关系时互质。不含相同质因数的两个合数互质；
            （5）任何相邻的两个数互质；
            （6）任取出两个正整数他们互质的概率（最大公约数为一）为6/π^2。

        二.例如:

                      约数1     约数2
            数1  5      1        5
            数2  7      1        7

            其中,5和7的最大公约数只有1,所以5和7互为质数

        ------------------------------------------------------------------------

                      约数1     约数2
            数1  3      1        3
            数2  4      1        4

            其中,3和4的最大公约数只有1
     */
}
