package com.xzzz.Other.计算机知识;

public class 位字节字符编码 {
    /**

    一. 位(bit 简称b)
        1.概念:
            数据存储的最小单位。每个二进制数字0或者1就是1个位.
            位数是计算机的CPU寄存器最大寻址数决定的.

    二. 字节(byte 简称B)
        1 byte = 8 bit;

        1.概念:
            是计算机信息技术用于计量存储容量的一种计量单位，通常情况下一字节等于八位，也在一些计算机编程语言中表示数据类型和语言字符。
        2.占用字节:
             UTF-8编码：一个英文字符等于一个字节，一个中文（含繁体）等于三个字节。中文标点占三个字节，英文标点占一个字节
             Unicode编码：一个英文等于两个字节，一个中文（含繁体）等于两个字节。中文标点占两个字节，英文标点占两个字节
        3.Java用法:
            byte = -128 - 127;






     */
}
